In [1]:
import pandas as pd

In [2]:
# merging ot concateating datasets

In [3]:
import pandas as pd

In [4]:
staff=pd.DataFrame([
    {"name":"gokul","role":"hr"},
    {"name":"hari","role":"pr"},
    {"name":"sr","role":"pune"}
])

In [5]:
staff

    name  role
0  gokul    hr
1   hari    pr
2     sr  pune

In [6]:
staff=staff.set_index('name')

In [7]:
staff

       role
name
gokul    hr
hari     pr
sr     pune

In [8]:
student=pd.DataFrame([
    {"name":"gokul","role":"hr"},
    {"name":"sjsjsjj","role":"prlsls"},
    {"name":"sraa","role":"klklkl"}
])

In [10]:
student=student.set_index('name')

KeyError: "None of ['name'] are in the columns"

In [12]:
student

           role
name
gokul        hr
sjsjsjj  prlsls
sraa     klklkl

In [15]:
pd.merge(staff,student,how="outer",left_index=True,right_index=True)#full outer join in similiar to union

        role_x  role_y
name
gokul       hr      hr
hari        pr     NaN
sjsjsjj    NaN  prlsls
sr        pune     NaN
sraa       NaN  klklkl

In [16]:
# now we want to get th e intersection set the how attribute to inner
pd.merge(staff,student,how="inner",left_index=True,right_index=True)#full outer join in similiar to union

      role_x role_y
name
gokul     hr     hr

In [17]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [20]:
x=obj2['California']
obj2['California']==x

False

In [21]:
import pandas as pd
d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
    '5': 'Ryan'
}
S = pd.Series(d)